Untitled Folder 2/Untitled Folder/app/views/beers/show.html.erb

<p>
  <% if @beer.ratings.empty? %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
SELECT 1 AS one FROM "ratings" WHERE "ratings"."beer_id" = ? LIMIT 1  [["beer_id", 1]]