Untitled Folder 2/Untitled Folder/app/views/users/show.html.erb

</p>
<p>Ratings: <%= @user.ratings.count%></p>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 2]]

<p>
<% if @user.memeberships.count == 0 %>
---
SELECT "memeberships".* FROM "memeberships" WHERE "memeberships"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "memeberships" WHERE "memeberships"."user_id" = ?  [["user_id", 2]]


<% if @user.ratings.any? %>
---
SELECT 1 AS one FROM "ratings" WHERE "ratings"."user_id" = ? LIMIT 1  [["user_id", 2]]