Untitled Folder 2/Untitled Folder/app/controllers/beer_clubs_controller.rb

  def index
    @beer_clubs = BeerClub.all
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def show
    @members=Memebership.all
---
SELECT "memeberships".* FROM "memeberships" WHERE "memeberships"."beer_club_id" = ?  [["beer_club_id", 1]]

  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("city", "created_at", "founded", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Helsinki"], ["created_at", Sun, 02 Feb 2014 16:42:27 UTC +00:00], ["founded", 2014], ["name", "Kaljakerho"], ["updated_at", Sun, 02 Feb 2014 16:42:27 UTC +00:00]]

    def set_beer_club
      @beer_club = BeerClub.find(params[:id])
---
SELECT "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", "1"]]